Revit 2026 API

# FilterInverseRule Constructor

---

Constructs a new instance of FilterInverseRule.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FilterInverseRule(
	FilterRule innerRule
)
```
```vb
Public Sub New (
	innerRule As FilterRule
)
```
```cpp
public:
FilterInverseRule(
	FilterRule^ innerRule
)
```
```fsharp
new :
        innerRule : FilterRule -> FilterInverseRule
```

#### Parameters

innerRule FilterRule
     The rule to invert.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

FilterInverseRule Class

Autodesk.Revit.DB Namespace